# Тесты для lab_04_04_02

## Ввод:
Одна строка

## Вывод:
Строка из изходных слов в обратном порядке, для каждого слова удалить из слова все последующие вхождения первой буквы


Требуется написать программу, которая запрашивает у пользователя строку 
и разбивает оную на слова. В результате разбора строки должен быть сформирован 
массив слов. Из слов, отличных от последнего, составляется новая строка. 
Слова в результирующую строку помещаются в обратном порядке с одним пробелом 
в качестве разделителя. После последнего слова пробел не добавляется.

Прежде, чем очередное слово помещается в результирующую строку, 
оно подвергается преобразованию в соответствии с вариантом.
Если результирующая строка не пустая, она выводится на экран следующим образом
printf("Result:␣%s\n", new_str);

Удалить из слова все последующие вхождения первой буквы.


## Позитивные тесты:
- 01 - Корректная дата
- 02 - Маленький год (10)
- 03 - 29 февраля, высокосный год (YES)
- 04 - 31 ареля (нет дня)
- 05 - Нули перед датой
- 06 - Нули перед годом
- 07 - 29 февраля, невысокосный год (NO)
- 08 - Табы в качестве разделителей
- 09 - Отрицательный год
- 10 - Нулевой год
- 11 - Нулевой день


## Негативные тесты:
- 01 - Слишком длинная строка

